log/128k/128k.out
seqwrites128k: (g=0): rw=write, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
seqread128k: (g=1): rw=read, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
randwrite128k: (g=2): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
randread128k: (g=3): rw=randread, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
randrw128k: (g=4): rw=randread, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=64
fio-2.1.11
Starting 5 threads
seqwrites128k: Laying out IO file(s) (1 file(s) / 2048MB)
seqread128k: Laying out IO file(s) (1 file(s) / 2048MB)
randwrite128k: Laying out IO file(s) (1 file(s) / 2048MB)
randread128k: Laying out IO file(s) (1 file(s) / 2048MB)
randrw128k: Laying out IO file(s) (1 file(s) / 2048MB)

seqwrites128k: (groupid=0, jobs=1): err= 0: pid=10793: Tue May 16 14:27:10 2017
  write: io=2048.0MB, bw=109523KB/s, iops=855, runt= 19148msec
    slat (usec): min=11, max=58728, avg=40.33, stdev=621.36
    clat (msec): min=3, max=317, avg=74.74, stdev=49.04
     lat (msec): min=3, max=317, avg=74.79, stdev=49.04
    clat percentiles (msec):
     |  1.00th=[    9],  5.00th=[   15], 10.00th=[   21], 20.00th=[   33],
     | 30.00th=[   45], 40.00th=[   58], 50.00th=[   68], 60.00th=[   77],
     | 70.00th=[   90], 80.00th=[  109], 90.00th=[  137], 95.00th=[  174],
     | 99.00th=[  237], 99.50th=[  258], 99.90th=[  293], 99.95th=[  302],
     | 99.99th=[  310]
    bw (KB  /s): min=95041, max=123392, per=99.90%, avg=109415.63, stdev=5689.10
    lat (msec) : 4=0.01%, 10=1.79%, 20=8.05%, 50=24.29%, 100=42.03%
    lat (msec) : 250=23.16%, 500=0.67%
  cpu          : usr=1.48%, sys=2.57%, ctx=13257, majf=0, minf=384
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=16384/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
seqread128k: (groupid=1, jobs=1): err= 0: pid=10794: Tue May 16 14:27:10 2017
  read : io=2048.0MB, bw=213039KB/s, iops=1664, runt=  9844msec
    slat (usec): min=16, max=909, avg=28.76, stdev=11.64
    clat (msec): min=1, max=535, avg=38.40, stdev=32.22
     lat (msec): min=1, max=535, avg=38.43, stdev=32.22
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   13], 10.00th=[   16], 20.00th=[   23],
     | 30.00th=[   27], 40.00th=[   32], 50.00th=[   37], 60.00th=[   42],
     | 70.00th=[   46], 80.00th=[   51], 90.00th=[   58], 95.00th=[   63],
     | 99.00th=[   84], 99.50th=[  123], 99.90th=[  529], 99.95th=[  537],
     | 99.99th=[  537]
    bw (KB  /s): min=86819, max=228864, per=100.00%, avg=214516.37, stdev=32887.15
    lat (msec) : 2=0.05%, 4=0.34%, 10=2.95%, 20=12.69%, 50=62.16%
    lat (msec) : 100=21.06%, 250=0.38%, 500=0.18%, 750=0.18%
  cpu          : usr=0.85%, sys=6.79%, ctx=14307, majf=0, minf=2342
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randwrite128k: (groupid=2, jobs=1): err= 0: pid=10795: Tue May 16 14:27:10 2017
  write: io=2048.0MB, bw=93853KB/s, iops=733, runt= 22345msec
    slat (usec): min=14, max=99956, avg=41.79, stdev=824.98
    clat (msec): min=3, max=377, avg=87.23, stdev=54.59
     lat (msec): min=3, max=377, avg=87.27, stdev=54.60
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   11], 10.00th=[   17], 20.00th=[   33],
     | 30.00th=[   51], 40.00th=[   69], 50.00th=[   84], 60.00th=[  100],
     | 70.00th=[  117], 80.00th=[  135], 90.00th=[  159], 95.00th=[  182],
     | 99.00th=[  229], 99.50th=[  251], 99.90th=[  289], 99.95th=[  310],
     | 99.99th=[  347]
    bw (KB  /s): min=67889, max=113920, per=100.00%, avg=94025.91, stdev=9759.10
    lat (msec) : 4=0.37%, 10=4.24%, 20=7.82%, 50=17.15%, 100=30.65%
    lat (msec) : 250=39.28%, 500=0.49%
  cpu          : usr=0.98%, sys=2.31%, ctx=9320, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=0/w=16384/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randread128k: (groupid=3, jobs=1): err= 0: pid=10796: Tue May 16 14:27:10 2017
  read : io=2048.0MB, bw=218271KB/s, iops=1705, runt=  9608msec
    slat (usec): min=17, max=310, avg=27.35, stdev= 6.79
    clat (msec): min=1, max=358, avg=37.49, stdev=23.23
     lat (msec): min=1, max=358, avg=37.52, stdev=23.23
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   12], 10.00th=[   16], 20.00th=[   21],
     | 30.00th=[   26], 40.00th=[   31], 50.00th=[   36], 60.00th=[   41],
     | 70.00th=[   46], 80.00th=[   51], 90.00th=[   59], 95.00th=[   67],
     | 99.00th=[  117], 99.50th=[  153], 99.90th=[  277], 99.95th=[  351],
     | 99.99th=[  359]
    bw (KB  /s): min=185600, max=228608, per=100.00%, avg=218354.53, stdev=14092.53
    lat (msec) : 2=0.03%, 4=0.25%, 10=2.63%, 20=16.35%, 50=59.22%
    lat (msec) : 100=20.03%, 250=1.35%, 500=0.15%
  cpu          : usr=0.75%, sys=6.99%, ctx=16018, majf=0, minf=33
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64
randrw128k: (groupid=4, jobs=1): err= 0: pid=10797: Tue May 16 14:27:10 2017
  read : io=2048.0MB, bw=215093KB/s, iops=1680, runt=  9750msec
    slat (usec): min=16, max=233, avg=27.66, stdev= 6.20
    clat (msec): min=2, max=263, avg=38.05, stdev=20.54
     lat (msec): min=2, max=263, avg=38.08, stdev=20.53
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   12], 10.00th=[   16], 20.00th=[   22],
     | 30.00th=[   27], 40.00th=[   32], 50.00th=[   37], 60.00th=[   42],
     | 70.00th=[   46], 80.00th=[   52], 90.00th=[   60], 95.00th=[   67],
     | 99.00th=[  118], 99.50th=[  139], 99.90th=[  180], 99.95th=[  190],
     | 99.99th=[  255]
    bw (KB  /s): min=156416, max=228864, per=100.00%, avg=215201.68, stdev=21105.85
    lat (msec) : 4=0.20%, 10=3.63%, 20=13.04%, 50=59.94%, 100=21.69%
    lat (msec) : 250=1.50%, 500=0.01%
  cpu          : usr=1.27%, sys=6.40%, ctx=14198, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued    : total=r=16384/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: io=2048.0MB, aggrb=109523KB/s, minb=109523KB/s, maxb=109523KB/s, mint=19148msec, maxt=19148msec

Run status group 1 (all jobs):
   READ: io=2048.0MB, aggrb=213038KB/s, minb=213038KB/s, maxb=213038KB/s, mint=9844msec, maxt=9844msec

Run status group 2 (all jobs):
  WRITE: io=2048.0MB, aggrb=93853KB/s, minb=93853KB/s, maxb=93853KB/s, mint=22345msec, maxt=22345msec

Run status group 3 (all jobs):
   READ: io=2048.0MB, aggrb=218271KB/s, minb=218271KB/s, maxb=218271KB/s, mint=9608msec, maxt=9608msec

Run status group 4 (all jobs):
   READ: io=2048.0MB, aggrb=215092KB/s, minb=215092KB/s, maxb=215092KB/s, mint=9750msec, maxt=9750msec

Disk stats (read/write):
  sdb: ios=48736/32650, merge=48/172, ticks=1845800/2767908, in_queue=4614960, util=98.28%